#include "menus.h"

void print_titologioco() {
    printf("\n\n");
    printf("██╗  ██╗      ████████╗███████╗████████╗██████╗ ██╗███████╗\n");
    printf("╚██╗██╔╝      ╚══██╔══╝██╔════╝╚══██╔══╝██╔══██╗██║██╔════╝\n");
    printf(" ╚███╔╝ █████╗   ██║   █████╗     ██║   ██████╔╝██║███████╗\n");
    printf(" ██╔██╗ ╚════╝   ██║   ██╔══╝     ██║   ██╔══██╗██║╚════██║\n");
    printf("██╔╝ ██╗         ██║   ███████╗   ██║   ██║  ██║██║███████║\n");
    printf("╚═╝  ╚═╝         ╚═╝   ╚══════╝   ╚═╝   ╚═╝  ╚═╝╚═╝╚══════╝\n");
    printf("Berton Alex Giulio - 884378\n");
    printf("\n\n");
}


Scelta_t menu_gioco() {
    int scelta = 0;
    printf("Benvenuto! Cosa vuoi fare?\n   1) Gioca da solo\n   2) Gioca con un amico\n   3) Settings\n");

    scanf("%d", &scelta);
    while(!(scelta >= 1 && scelta <= 3))
        scanf("%d", &scelta);

    switch (scelta) {
        case 1:
            return SINGLEPLAYER;
        case 2:
            return MULTIPLAYER;
        default:
            return SETTINGS;
    }
}